#+title: Learning org-mode
#+author: Daniel Elnatan
#+OPTIONS: ^:{}

# note: the options above enable sub/super script in this org file. Do C-c C-c
# while on the OPTIONS line to refresh local setup.

# you can actually execute this line of code below with C-x C-e
=(message (if org-hide-emphasis-markers "hide" "shown"))=

* Quick org-mode refresher

* Heading
=TAB=, on a heading to fold/unfold
=C-u TAB=, rotate through /overview/ -> contents -> show all
=C-u C-u TAB=, switch to initial visibility
=C-u C-u C-u TAB=, show all
=M-S-left/right=, promote/demote heading by one level
=M-S-up/down=, move item up/downa
=S-TAB=, get an overview of document (just headings)

** Sub-heading
But this heading isnt
*** Sub-sub-heading
Contents should appear indented if we set =org-startup-indented= as =t=.

* Notes
Any heading can be a TODO list. See example right below.

* TODO heading 1

*Bold*, /italic/, _underline_, ~code~, =literal=, +strikethrough+.
Both ~code~ and =literal= need to be the inner-most markers.

* special heading                                       :heading_tag:new_tag:
tags can be added to a headline via =C-c C-c= (while cursor is in headline)
To enter a new tag for current headline, =C-c C-q= (while cursor is anywhere in content)

* DONE Timestamps
Use =C-c .= to insert timestamp (it triggers an agenda entry). Use =C-c !=, to
insert an inactive timestamp (does not trigger agenda entry). You can enter the
time in the mini-buffer as '2pm' or '10am'.

- <2022-12-05 Mon 14:00> UAW march to the capital (Sacramento, CA)
- <2022-12-06 Tue> Lily returns to daycare (forest room).
      
* DONE Tasks
Trigger TODO by =C-c C-t=. (cycles through TODO/DONE/nil)
=M-shift-RET=, enters a new todo item
** DONE start new file
** TODO another todo item

* Links
=C-c C-l=, calls ~org-insert-link~. =[[link address][link description]]=.

* An unordered list
- item 1 (M-RET creates a new entry below)
- item 2
- item 3

* An ordered list
1) item 1
2) item 2
3) item 3

* Lists can contain checkboxes
- [ ] not done (=M-Shift-RET= creates a new checkbox below)
- [X] task completed (=C-c C-c= toggles checked)
- [-] to toggle intermediate state, use double prefix (=C-u C-u C-c C-c=).

You can also put a link to a heading in the document [[An unordered list][a heading above]]. Clicking
on the link moves the cursor position to that particular heading. The code is:
=[[An unordered list][a heading above]]=.

To move items in list M-Shift-up/down.

* Tables
You can create tables easily in org-mode using =|=:

| Header 1 | Header 2 | Header 3 | Header 4 |
|----------+----------+----------+----------|
|        2 |        7 |        1 |        1 |
|        3 |        8 |        2 |        1 |
|        1 |       11 |        3 |        1 |
|        7 |       23 |        4 |        0 |
|----------+----------+----------+----------|
|       13 |       49 |       10 |        3 |
#+TBLFM: @6=vsum(@2..@5)

The above formula =@6=vsum(@2..@5)= states: The 6^{th} row is computed from the sum
of rows 2 to 5.  It did operations across rows, with the output going into a new
row below.

| Header 1 | Header 2 | Sum | Means |
|----------+----------+-----+-------|
|        1 |        2 |   3 |   1.5 |
|        2 |        4 |   6 |     3 |
|        3 |        6 |   9 |   4.5 |
|        4 |        8 |  12 |     6 |
#+TBLFM: $3=vsum($1..$2)::$4=vmean($1..$2)

The above formula does operations across columns.

To use formulas, familiarize yourself with the reference convention. The
available simple commands are: =vsum()=, =vmean()=.  The notation =@= denotes row
position, and =$= denotes column position. So =@3$4= is the third row and fourth
column. To compute, =C-c C-c=.

To align/complete tables simply use =tab=. You also use =tab= and =Shift-tab= to
navigate between one cell to the previous one.

Or you can do =C-c |=

You can *move column* and *move row* with =M-<right/left>= and =M-<up/down>=.
You can *insert column* and *insert row* with =S-M<right/left>= and =S-M-<up/down>=.

** Advanced tables
You can use formulas in your tables (see above example)!!!
To refer to current cursor location, =C-c ?=.
To visualize the reference =C-c }=.

* Comments
# this is a comment
@@comment: like so@@ is an inline comment

#+begin_comment
this is a block comment
#+end_comment

* Notes on mastering emacs book

A *visual line* is defined as what you currently see. Each line is treated as
separate even if it has only one.

A *logical line* is the actual content of the buffer.

A *screen line* is the same as the *visual line*

The definition of a *word* depends on the mode being used. This definition is
kept in the *syntax table*. To see you can 

* Fun elisp stuff
You can run code in org-mode via org-babel. Do =C-c C-, s= to insert source code
and add the language (e.g. emacs-lisp) after =begin_src=. Run the "cell" with =C-c C-c=.

#+begin_src emacs-lisp
  (message "message in a bottle")
#+end_src

#+RESULTS:
: message in a bottle

* Editing tasks
** Centering text
                        # ..........Centering..........#
